app/views/tasks/index.html.slim

SELECT "task_types".* FROM "task_types"
---
    .col-sm-10
      = f.select :task_type_id_eq, options_for_select(TaskType.all.map{|c|[c[:name], c[:id]]}), {include_blank: true}, class: 'form-select'
  .form-group.row.my-3

SELECT  "task_types".* FROM "task_types" WHERE "task_types"."id" = $1 ORDER BY "task_types"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          td = link_to task.name, task
          td = @task_types.where(id: task.task_type_id).first.name