app/views/tasks/show.html.slim

      th= Task.human_attribute_name(:task_type_id)
      td= @task_types.where(id: @task.task_type_id).first.name
---
SELECT  "task_types".* FROM "task_types" WHERE "task_types"."id" = $1 ORDER BY "task_types"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]