app/controllers/task_types_controller.rb

  def index
    @q = TaskType.all.ransack(params[:q])
    @task_types = @q.result(distinct: true).page(params[:page])  # ソート
---
SELECT  DISTINCT "task_types".* FROM "task_types" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  DISTINCT "task_types"."id" AS count_column FROM "task_types" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @task_type = TaskType.new(task_type_params)
    if params[:back].present?
      render :new
      return
    end
    if @task_type.save
---
INSERT INTO "task_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "MTG"], ["created_at", "2022-06-20 08:58:03.956362"], ["updated_at", "2022-06-20 08:58:03.956362"]]

  def set_task_type
    @task_type = TaskType.find(params[:id])
---
SELECT  "task_types".* FROM "task_types" WHERE "task_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]