app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])  # ソート
    @task_types = TaskType.all
---
SELECT  DISTINCT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 3], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  DISTINCT "tasks"."id" AS count_column FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3) subquery_for_count  [["user_id", 3], ["LIMIT", 25], ["OFFSET", 0]]
SELECT "task_types".* FROM "task_types"

  def new
    @task = Task.new
    @task_types = TaskType.all
---
SELECT "task_types".* FROM "task_types"

  def create
    @task = Task.new(task_params.merge(user_id: current_user.id))
    if params[:back].present?
      render :new
      return
    end
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id", "status", "task_type_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"